In [1]:
#importing the pandas library:
import pandas as pd
import numpy as np

In [2]:
array= np.array([1,2,3,4,6,7,8])

In [3]:
S= pd.Series(array, index=['a','b','c','d','e','f','g'])
S

a    1
b    2
c    3
d    4
e    6
f    7
g    8
dtype: int32

In [4]:
first_series= pd.Series(list('abcdef'))
first_series

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [5]:
np_country= np.array(['India','pak','china','Srilanka','afghanistan','russia','australia'])

In [6]:
country_series= pd.Series(np_country)

In [7]:
country_series

0          India
1            pak
2          china
3       Srilanka
4    afghanistan
5         russia
6      australia
dtype: object

In [8]:
dict_gdp={'gdp':[1008.90,56890.90,3456.899,344568,788656.98,4566,8986.876],'name':['India','pak','china','Srilanka','afghanistan','russia','australia']}

In [9]:
dict_gdp

{'gdp': [1008.9, 56890.9, 3456.899, 344568, 788656.98, 4566, 8986.876],
 'name': ['India',
  'pak',
  'china',
  'Srilanka',
  'afghanistan',
  'russia',
  'australia']}

In [10]:
dict_gdp_series= pd.Series(dict_gdp)

In [11]:
dict_gdp_series

gdp     [1008.9, 56890.9, 3456.899, 344568, 788656.98,...
name    [India, pak, china, Srilanka, afghanistan, rus...
dtype: object

In [12]:
gdp_series= pd.Series([1008.90,56890.90,3456.899,344568,788656.98,4566,8986.876], index=['India','pak','china','Srilanka','afghanistan','russia','australia'])

In [13]:
gdp_series

India            1008.900
pak             56890.900
china            3456.899
Srilanka       344568.000
afghanistan    788656.980
russia           4566.000
australia        8986.876
dtype: float64

In [14]:
scalar_series= pd.Series(5, index=['a','b','c','d'])

In [15]:
scalar_series

a    5
b    5
c    5
d    5
dtype: int64

In [16]:
gdp_series

India            1008.900
pak             56890.900
china            3456.899
Srilanka       344568.000
afghanistan    788656.980
russia           4566.000
australia        8986.876
dtype: float64

In [17]:
#To access the first element in gdp_series:
gdp_series[0:1]

India    1008.9
dtype: float64

In [18]:
#To access the first 5 countries:
gdp_series[0:5]

India            1008.900
pak             56890.900
china            3456.899
Srilanka       344568.000
afghanistan    788656.980
dtype: float64

In [19]:
#Look up a country by its name: ##use loc function:
gdp_series.loc['russia']

4566.0

In [20]:
#Look up gdp of a particular country:
gdp_series.loc['pak']

56890.9

In [21]:
#Look up by position:
gdp_series.iloc[4]

788656.98

In [22]:
gdp_series[4:5]

afghanistan    788656.98
dtype: float64

In [23]:
#Vectorized operations are performed by data elements position:
first_vector= pd.Series([1,2,3,4,5], index= ['a','b','c','d','e'])
second_vector= pd.Series([10,20,30,40,50], index= ['a','b','c','d','e'])
third_vector= pd.Series([12,23,34,5,67], index= ['a','b','c','g','h'])

In [24]:
first_vector+second_vector

a    11
b    22
c    33
d    44
e    55
dtype: int64

In [25]:
first_vector+third_vector

a    13.0
b    25.0
c    37.0
d     NaN
e     NaN
g     NaN
h     NaN
dtype: float64

In [26]:
import pandas as pd

In [27]:
#Last 5 year olympic data:
olympic_data= {'Host_City':['London','Bejing','Athens','Sydney','Atlanta'], 'Year':[2012,2008,2004,2000,1996], "No_of_participating_countries":[205,204,201,200,197]}

In [28]:
olympic_data

{'Host_City': ['London', 'Bejing', 'Athens', 'Sydney', 'Atlanta'],
 'Year': [2012, 2008, 2004, 2000, 1996],
 'No_of_participating_countries': [205, 204, 201, 200, 197]}

In [29]:
#data frame:
olympic_data_df=pd.DataFrame(olympic_data)
olympic_data_df

  Host_City  Year  No_of_participating_countries
0    London  2012                            205
1    Bejing  2008                            204
2    Athens  2004                            201
3    Sydney  2000                            200
4   Atlanta  1996                            197

# Creating a dataframe and a series from a dictionary:
olympic_data_dict= {'London':{2012:205},"Bejing":{2008:204},"Athens":{2004:201},'Sydney':{2000,200},'Atlanta':{1996:197}}
olympic_data_dict
olympic_data_Series= pd.Series(olympic_data_dict)
olympic_data_Series

In [30]:
olympic_data_dict= {'London':{2012:205},"Bejing":{2008:204},"Athens":{2004:201},'Sydney':{2000,200},'Atlanta':{1996:197}}
olympic_data_Series= pd.Series(olympic_data_dict)
olympic_data_Series

London     {2012: 205}
Bejing     {2008: 204}
Athens     {2004: 201}
Sydney     {2000, 200}
Atlanta    {1996: 197}
dtype: object

In [31]:
olympic_data_dict= {'London':{2012:205},"Bejing":{2008:204}}
olympic_data_dict_df= pd.DataFrame(olympic_data_dict)
olympic_data_dict_df

      London  Bejing
2012   205.0     NaN
2008     NaN   204.0

In [32]:
#Selecting a city name:
olympic_data_df.Host_City

0     London
1     Bejing
2     Athens
3     Sydney
4    Atlanta
Name: Host_City, dtype: object

In [33]:
#Slicing:
olympic_data_df.Host_City[2:5]

2     Athens
3     Sydney
4    Atlanta
Name: Host_City, dtype: object

In [34]:
#using DESCRIBE to display all the content:
olympic_data_df.describe

<bound method NDFrame.describe of   Host_City  Year  No_of_participating_countries
0    London  2012                            205
1    Bejing  2008                            204
2    Athens  2004                            201
3    Sydney  2000                            200
4   Atlanta  1996                            197>

In [35]:
olympic_data_df.info

<bound method DataFrame.info of   Host_City  Year  No_of_participating_countries
0    London  2012                            205
1    Bejing  2008                            204
2    Athens  2004                            201
3    Sydney  2000                            200
4   Atlanta  1996                            197>

In [36]:
#Creating a dataframe from dict of Series:
olym_count= pd.Series(['London','Bejing','Athens','Sydney','Atlanta'], index=[2012,2008,2004,2000,1996])
olym_count

2012     London
2008     Bejing
2004     Athens
2000     Sydney
1996    Atlanta
dtype: object

In [37]:
olym_no_of_part_count= pd.Series([205,204,201,200,197], index=[2012,2008,2004,2000,1996])
olym_no_of_part_count

2012    205
2008    204
2004    201
2000    200
1996    197
dtype: int64

In [38]:
#Creating a dataframe from two series:
olym_df= pd.DataFrame({'Host_Countries':olym_count,'No_of_participating countries':olym_no_of_part_count})
olym_df

     Host_Countries  No_of_participating countries
2012         London                            205
2008         Bejing                            204
2004         Athens                            201
2000         Sydney                            200
1996        Atlanta                            197

# Creating data Frame from numpy array:

In [39]:
import numpy as np
import pandas as pd

In [40]:
np_array= np.array([2012,2007,2006,2018,2019])

In [41]:
np_array_df= pd.DataFrame({'Year':np_array})
np_array_df

   Year
0  2012
1  2007
2  2006
3  2018
4  2019

In [42]:
ser1= pd.Series([10,20,30,40], index=['a','b','c','d'])
ser1

a    10
b    20
c    30
d    40
dtype: int64

In [43]:
#For reindexing of the series:
ser1.reindex(['c','d','b','a'])

c    30
d    40
b    20
a    10
dtype: int64

In [44]:
ser2= pd.Series([1,2,3,None], index=['a','b','c','d'])
ser2

a    1.0
b    2.0
c    3.0
d    NaN
dtype: float64

In [45]:
ser2.d

nan

In [46]:
#To know where the value is null
ser2.isnull()

a    False
b    False
c    False
d     True
dtype: bool

In [47]:
ser2.d

nan

In [48]:
np.where(ser2.isnull()== True)

(array([3], dtype=int64),)

In [49]:
ser2[3]

nan

In [50]:
df= pd.read_csv('C:\Python\Dataset\CARS.csv')

In [51]:
df

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Acura,MDX,SUV,Asia,All,"$36,945","$33,337",3.5,6.0,265,17,23,4451,106,189
1,Acura,RSX Type S 2dr,Sedan,Asia,Front,"$23,820","$21,761",2.0,4.0,200,24,31,2778,101,172
2,Acura,TSX 4dr,Sedan,Asia,Front,"$26,990","$24,647",2.4,4.0,200,22,29,3230,105,183
3,Acura,TL 4dr,Sedan,Asia,Front,"$33,195","$30,299",3.2,6.0,270,20,28,3575,108,186
4,Acura,3.5 RL 4dr,Sedan,Asia,Front,"$43,755","$39,014",3.5,6.0,225,18,24,3880,115,197
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
423,Volvo,C70 LPT convertible 2dr,Sedan,Europe,Front,"$40,565","$38,203",2.4,5.0,197,21,28,3450,105,186
424,Volvo,C70 HPT convertible 2dr,Sedan,Europe,Front,"$42,565","$40,083",2.3,5.0,242,20,26,3450,105,186
425,Volvo,S80 T6 4dr,Sedan,Europe,Front,"$45,210","$42,573",2.9,6.0,268,19,26,3653,110,190
426,Volvo,V40,Wagon,Europe,Front,"$26,135","$24,641",1.9,4.0,170,22,29,2822,101,180
427,Volvo,XC70,Wagon,Europe,All,"$35,145","$33,112",2.5,5.0,208,20,27,3823,109,186

In [52]:
pd.read_csv?

In [53]:
#for first five rows
df.head()

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Acura,MDX,SUV,Asia,All,"$36,945","$33,337",3.5,6.0,265,17,23,4451,106,189
1,Acura,RSX Type S 2dr,Sedan,Asia,Front,"$23,820","$21,761",2.0,4.0,200,24,31,2778,101,172
2,Acura,TSX 4dr,Sedan,Asia,Front,"$26,990","$24,647",2.4,4.0,200,22,29,3230,105,183
3,Acura,TL 4dr,Sedan,Asia,Front,"$33,195","$30,299",3.2,6.0,270,20,28,3575,108,186
4,Acura,3.5 RL 4dr,Sedan,Asia,Front,"$43,755","$39,014",3.5,6.0,225,18,24,3880,115,197

In [54]:
#For last 5 rows
df.tail()

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
423,Volvo,C70 LPT convertible 2dr,Sedan,Europe,Front,"$40,565","$38,203",2.4,5.0,197,21,28,3450,105,186
424,Volvo,C70 HPT convertible 2dr,Sedan,Europe,Front,"$42,565","$40,083",2.3,5.0,242,20,26,3450,105,186
425,Volvo,S80 T6 4dr,Sedan,Europe,Front,"$45,210","$42,573",2.9,6.0,268,19,26,3653,110,190
426,Volvo,V40,Wagon,Europe,Front,"$26,135","$24,641",1.9,4.0,170,22,29,2822,101,180
427,Volvo,XC70,Wagon,Europe,All,"$35,145","$33,112",2.5,5.0,208,20,27,3823,109,186

In [55]:
#To get specific number of rows from starting
df.head(10)

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Acura,MDX,SUV,Asia,All,"$36,945","$33,337",3.5,6.0,265,17,23,4451,106,189
1,Acura,RSX Type S 2dr,Sedan,Asia,Front,"$23,820","$21,761",2.0,4.0,200,24,31,2778,101,172
2,Acura,TSX 4dr,Sedan,Asia,Front,"$26,990","$24,647",2.4,4.0,200,22,29,3230,105,183
3,Acura,TL 4dr,Sedan,Asia,Front,"$33,195","$30,299",3.2,6.0,270,20,28,3575,108,186
4,Acura,3.5 RL 4dr,Sedan,Asia,Front,"$43,755","$39,014",3.5,6.0,225,18,24,3880,115,197
5,Acura,3.5 RL w/Navigation 4dr,Sedan,Asia,Front,"$46,100","$41,100",3.5,6.0,225,18,24,3893,115,197
6,Acura,NSX coupe 2dr manual S,Sports,Asia,Rear,"$89,765","$79,978",3.2,6.0,290,17,24,3153,100,174
7,Audi,A4 1.8T 4dr,Sedan,Europe,Front,"$25,940","$23,508",1.8,4.0,170,22,31,3252,104,179
8,Audi,A41.8T convertible 2dr,Sedan,Europe,Front,"$35,940","$32,506",1.8,4.0,170,23,30,3638,105,180
9,Audi,A4 3.0 4dr,Sedan,Europe,Front,"$31,840","$28,846",3.0,6.0,220,20,28,3462,104,179

In [56]:
#To get specific number of rows from bottom:
df.tail(10)

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
418,Volvo,S60 2.5 4dr,Sedan,Europe,All,"$31,745","$29,916",2.5,5.0,208,20,27,3903,107,180
419,Volvo,S60 T5 4dr,Sedan,Europe,Front,"$34,845","$32,902",2.3,5.0,247,20,28,3766,107,180
420,Volvo,S60 R 4dr,Sedan,Europe,All,"$37,560","$35,382",2.5,5.0,300,18,25,3571,107,181
421,Volvo,S80 2.9 4dr,Sedan,Europe,Front,"$37,730","$35,542",2.9,6.0,208,20,28,3576,110,190
422,Volvo,S80 2.5T 4dr,Sedan,Europe,All,"$37,885","$35,688",2.5,5.0,194,20,27,3691,110,190
423,Volvo,C70 LPT convertible 2dr,Sedan,Europe,Front,"$40,565","$38,203",2.4,5.0,197,21,28,3450,105,186
424,Volvo,C70 HPT convertible 2dr,Sedan,Europe,Front,"$42,565","$40,083",2.3,5.0,242,20,26,3450,105,186
425,Volvo,S80 T6 4dr,Sedan,Europe,Front,"$45,210","$42,573",2.9,6.0,268,19,26,3653,110,190
426,Volvo,V40,Wagon,Europe,Front,"$26,135","$24,641",1.9,4.0,170,22,29,2822,101,180
427,Volvo,XC70,Wagon,Europe,All,"$35,145","$33,112",2.5,5.0,208,20,27,3823,109,186

In [57]:
#To get the names of columns:
df.columns

Index(['name_of_car', 'Model', 'Type', 'Origin', 'DriveTrain', 'MSRP',
       'Invoice', 'EngineSize', 'Cylinders', 'Horsepower', 'MPG_City',
       'MPG_Highway', 'Weight', 'Wheelbase', 'Length'],
      dtype='object')

In [58]:
df.describe()

,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
count,428.000000,426.000000,428.000000,428.000000,428.000000,428.000000,428.000000,428.000000
mean,3.196729,5.807512,215.885514,20.060748,26.843458,3577.953271,108.154206,186.362150
std,1.108595,1.558443,71.836032,5.238218,5.741201,758.983215,8.311813,14.357991
min,1.300000,3.000000,73.000000,10.000000,12.000000,1850.000000,89.000000,143.000000
25%,2.375000,4.000000,165.000000,17.000000,24.000000,3104.000000,103.000000,178.000000
50%,3.000000,6.000000,210.000000,19.000000,26.000000,3474.500000,107.000000,187.000000
75%,3.900000,6.000000,255.000000,21.250000,29.000000,3977.750000,112.000000,194.000000
max,8.300000,12.000000,500.000000,60.000000,66.000000,7190.000000,144.000000,238.000000

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 428 entries, 0 to 427
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name_of_car  428 non-null    object
 1   Model        428 non-null    object
 2   Type         428 non-null    object
 3   Origin       428 non-null    object
 4   DriveTrain   428 non-null    object
 5   MSRP         428 non-null    object
 6   Invoice      428 non-null    object
 7   EngineSize   428 non-null    float64
 8   Cylinders    426 non-null    float64
 9   Horsepower   428 non-null    int64
 10  MPG_City     428 non-null    int64
 11  MPG_Highway  428 non-null    int64
 12  Weight       428 non-null    int64
 13  Wheelbase    428 non-null    int64
 14  Length       428 non-null    int64
dtypes: float64(2), int64(6), object(7)
memory usage: 50.3+ KB

In [60]:
np.where(df.isnull()== True)

(array([247, 248], dtype=int64), array([8, 8], dtype=int64))

In [61]:
df.iloc[247:249]

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
247,Mazda,RX-8 4dr automatic,Sports,Asia,Rear,"$25,700","$23,794",1.3,NaN,197,18,25,3053,106,174
248,Mazda,RX-8 4dr manual,Sports,Asia,Rear,"$27,200","$25,179",1.3,NaN,238,18,24,3029,106,174

In [62]:
df['Cylinders'].mean()

5.807511737089202

In [63]:
df.replace?

In [64]:
#df.Cylinders.replace()
df.iloc[247:249].replace(np.NaN,5.807512)

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
247,Mazda,RX-8 4dr automatic,Sports,Asia,Rear,"$25,700","$23,794",1.3,5.807512,197,18,25,3053,106,174
248,Mazda,RX-8 4dr manual,Sports,Asia,Rear,"$27,200","$25,179",1.3,5.807512,238,18,24,3029,106,174

In [65]:
df.shape

(428, 15)

In [66]:
df.index

RangeIndex(start=0, stop=428, step=1)

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 428 entries, 0 to 427
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name_of_car  428 non-null    object
 1   Model        428 non-null    object
 2   Type         428 non-null    object
 3   Origin       428 non-null    object
 4   DriveTrain   428 non-null    object
 5   MSRP         428 non-null    object
 6   Invoice      428 non-null    object
 7   EngineSize   428 non-null    float64
 8   Cylinders    426 non-null    float64
 9   Horsepower   428 non-null    int64
 10  MPG_City     428 non-null    int64
 11  MPG_Highway  428 non-null    int64
 12  Weight       428 non-null    int64
 13  Wheelbase    428 non-null    int64
 14  Length       428 non-null    int64
dtypes: float64(2), int64(6), object(7)
memory usage: 50.3+ KB

In [68]:
df.Model

0                          MDX
1               RSX Type S 2dr
2                      TSX 4dr
3                       TL 4dr
4                   3.5 RL 4dr
                ...
423    C70 LPT convertible 2dr
424    C70 HPT convertible 2dr
425                 S80 T6 4dr
426                        V40
427                       XC70
Name: Model, Length: 428, dtype: object

In [69]:
df['Model']

0                          MDX
1               RSX Type S 2dr
2                      TSX 4dr
3                       TL 4dr
4                   3.5 RL 4dr
                ...
423    C70 LPT convertible 2dr
424    C70 HPT convertible 2dr
425                 S80 T6 4dr
426                        V40
427                       XC70
Name: Model, Length: 428, dtype: object

In [70]:
df.columns #Name of the columns

Index(['name_of_car', 'Model', 'Type', 'Origin', 'DriveTrain', 'MSRP',
       'Invoice', 'EngineSize', 'Cylinders', 'Horsepower', 'MPG_City',
       'MPG_Highway', 'Weight', 'Wheelbase', 'Length'],
      dtype='object')

In [71]:
df.DriveTrain

0        All
1      Front
2      Front
3      Front
4      Front
       ...
423    Front
424    Front
425    Front
426    Front
427      All
Name: DriveTrain, Length: 428, dtype: object

In [72]:
df[['Model','Type']]

                       Model   Type
0                        MDX    SUV
1             RSX Type S 2dr  Sedan
2                    TSX 4dr  Sedan
3                     TL 4dr  Sedan
4                 3.5 RL 4dr  Sedan
..                       ...    ...
423  C70 LPT convertible 2dr  Sedan
424  C70 HPT convertible 2dr  Sedan
425               S80 T6 4dr  Sedan
426                      V40  Wagon
427                     XC70  Wagon

[428 rows x 2 columns]

In [73]:
##Loc function is to extract the rows, and iloc function is to give the specific location of an element:
df.loc[0:2]

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Acura,MDX,SUV,Asia,All,"$36,945","$33,337",3.5,6.0,265,17,23,4451,106,189
1,Acura,RSX Type S 2dr,Sedan,Asia,Front,"$23,820","$21,761",2.0,4.0,200,24,31,2778,101,172
2,Acura,TSX 4dr,Sedan,Asia,Front,"$26,990","$24,647",2.4,4.0,200,22,29,3230,105,183

In [74]:
df.iloc[0:2]

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Acura,MDX,SUV,Asia,All,"$36,945","$33,337",3.5,6.0,265,17,23,4451,106,189
1,Acura,RSX Type S 2dr,Sedan,Asia,Front,"$23,820","$21,761",2.0,4.0,200,24,31,2778,101,172

In [75]:
df.iloc[0:2,0]

0    Acura
1    Acura
Name: name_of_car, dtype: object

In [76]:
##Converting dict into data frame:
dict1= {'name':['Aashti', 'hamid', 'Alisha','farid'], 'age':[32,65,5,36], 'marks':[23,24,25,26]}
df_dict1= pd.DataFrame(dict1)
df_dict1

     name  age  marks
0  Aashti   32     23
1   hamid   65     24
2  Alisha    5     25
3   farid   36     26

In [77]:
#Converting marks as index:
dict2= {'name':['Aashti', 'hamid', 'Alisha','farid'], 'age':[32,65,5,36]}
df_dict2= pd.DataFrame(dict2, index=[23,24,25,26])
df_dict2

      name  age
23  Aashti   32
24   hamid   65
25  Alisha    5
26   farid   36

In [78]:
df_dict2.loc[24]

name    hamid
age        65
Name: 24, dtype: object

In [79]:
df_dict2.loc[24,'age']

65

In [80]:
df_dict2.iloc[1,1]

65

In [81]:
#Slice of rows from row-1 to row-3 and all columns
df_dict2.loc[23:25]

      name  age
23  Aashti   32
24   hamid   65
25  Alisha    5

In [82]:
#Slice of the rows from row-1 to row-3 and only column 'name':
df_dict2.loc[23:25,'name']

23    Aashti
24     hamid
25    Alisha
Name: name, dtype: object

In [83]:
#Slice of the rows from row-2 to row-4 and only column 'age':
df_dict2.loc[24:26,'age']

24    65
25     5
26    36
Name: age, dtype: int64

In [84]:
#Slice of the rows till row-3 and only column 'age':
df_dict2.loc[:25,'age']

23    32
24    65
25     5
Name: age, dtype: int64

In [85]:
#Extracting the values by index location: iloc

In [86]:
#Extract rows from 1-3 and all columns by iloc and loc
df_dict2.iloc[0:3,]

      name  age
23  Aashti   32
24   hamid   65
25  Alisha    5

In [87]:
df_dict2.loc[23:25]

      name  age
23  Aashti   32
24   hamid   65
25  Alisha    5

In [88]:
#Extract all the rows from 2nd row and all columns:
df_dict2.iloc[1:,]

      name  age
24   hamid   65
25  Alisha    5
26   farid   36

In [89]:
#Extract row 2 and 4, first and last column
df_dict2.iloc[[1,3],[0,1]]

     name  age
24  hamid   65
26  farid   36

In [90]:
df_dict2.loc[[24,26],['name','age']]

     name  age
24  hamid   65
26  farid   36

In [91]:
df_dict3= df_dict2

In [92]:
df_dict3.drop('name',axis= 1)

    age
23   32
24   65
25    5
26   36

In [93]:
df_dict3.drop('name', axis=1)

    age
23   32
24   65
25    5
26   36

In [94]:
df_dict3.drop(23, axis=0)

      name  age
24   hamid   65
25  Alisha    5
26   farid   36

In [95]:
df_dict3.drop('name', axis=1, inplace=True)

In [96]:
df_dict3.drop(23, axis=0, inplace=True)

In [97]:
df_dict3

    age
24   65
25    5
26   36

In [98]:
df_dict1.reset_index(inplace=True)

In [99]:
df_dict1.drop('index', axis=1, inplace=True)

In [100]:
df_dict1

     name  age  marks
0  Aashti   32     23
1   hamid   65     24
2  Alisha    5     25
3   farid   36     26

In [101]:
#Sort the values in ascending order:
df_dict1.sort_values('age',ascending=True)

     name  age  marks
2  Alisha    5     25
0  Aashti   32     23
3   farid   36     26
1   hamid   65     24

In [102]:
#Sort the values in descending order:
df_dict1.sort_values('marks', ascending=False)

     name  age  marks
3   farid   36     26
2  Alisha    5     25
1   hamid   65     24
0  Aashti   32     23

In [103]:
#To sort Cylinders in ascending order and weight in descending order:
df1=df.sort_values('Cylinders', ascending= True)
df2= df1.sort_values('Weight', ascending= False)
df2

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
118,Ford,Excursion 6.8 XLT,SUV,USA,All,"$41,475","$36,494",6.8,10.0,310,10,13,7190,137,227
166,Hummer,H2,SUV,USA,All,"$49,995","$45,815",6.0,8.0,316,10,12,6400,123,190
143,GMC,Yukon XL 2500 SLT,SUV,USA,All,"$46,265","$40,534",6.0,8.0,325,13,17,6133,130,219
229,Lincoln,Navigator Luxury,SUV,USA,All,"$52,775","$46,360",5.4,8.0,300,13,18,5969,119,206
62,Cadillac,Escalade EXT,Truck,USA,All,"$52,975","$48,541",6.0,8.0,345,13,17,5879,130,221
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
396,Toyota,MR2 Spyder convertible 2dr,Sports,Asia,Rear,"$25,130","$22,787",1.8,4.0,138,26,32,2195,97,153
383,Toyota,Echo 2dr auto,Sedan,Asia,Front,"$11,560","$10,896",1.5,4.0,108,33,39,2085,93,163
384,Toyota,Echo 4dr,Sedan,Asia,Front,"$11,290","$10,642",1.5,4.0,108,35,43,2055,93,163
382,Toyota,Echo 2dr manual,Sedan,Asia,Front,"$10,760","$10,144",1.5,4.0,108,35,43,2035,93,163
150,Honda,Insight 2dr (gas/electric),Hybrid,Asia,Front,"$19,110","$17,911",2.0,3.0,73,60,66,1850,95,155

In [104]:
df.sort_values(['Cylinders'], ascending=[True])
df.sort_values('Weight', ascending=False)

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
118,Ford,Excursion 6.8 XLT,SUV,USA,All,"$41,475","$36,494",6.8,10.0,310,10,13,7190,137,227
166,Hummer,H2,SUV,USA,All,"$49,995","$45,815",6.0,8.0,316,10,12,6400,123,190
143,GMC,Yukon XL 2500 SLT,SUV,USA,All,"$46,265","$40,534",6.0,8.0,325,13,17,6133,130,219
229,Lincoln,Navigator Luxury,SUV,USA,All,"$52,775","$46,360",5.4,8.0,300,13,18,5969,119,206
62,Cadillac,Escalade EXT,Truck,USA,All,"$52,975","$48,541",6.0,8.0,345,13,17,5879,130,221
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
396,Toyota,MR2 Spyder convertible 2dr,Sports,Asia,Rear,"$25,130","$22,787",1.8,4.0,138,26,32,2195,97,153
383,Toyota,Echo 2dr auto,Sedan,Asia,Front,"$11,560","$10,896",1.5,4.0,108,33,39,2085,93,163
384,Toyota,Echo 4dr,Sedan,Asia,Front,"$11,290","$10,642",1.5,4.0,108,35,43,2055,93,163
382,Toyota,Echo 2dr manual,Sedan,Asia,Front,"$10,760","$10,144",1.5,4.0,108,35,43,2035,93,163
150,Honda,Insight 2dr (gas/electric),Hybrid,Asia,Front,"$19,110","$17,911",2.0,3.0,73,60,66,1850,95,155

# Dealing with categorical data

In [105]:
#To get the count of Type of the cars: use pd.crosstab
pd.crosstab(df.Type, columns='count_of_type')

col_0   count_of_type
Type
Hybrid              3
SUV                60
Sedan             262
Sports             49
Truck              24
Wagon              30

In [106]:
#Count of the name_of_car:
pd.crosstab(df.name_of_car, columns='count')

col_0          count
name_of_car
Acura              7
Audi              19
BMW               20
Buick              9
Cadillac           8
Chevrolet         27
Chrysler          15
Dodge             13
Ford              23
GMC                8
Honda             17
Hummer             1
Hyundai           12
Infiniti           8
Isuzu              2
Jaguar            12
Jeep               3
Kia               11
Land Rover         3
Lexus             11
Lincoln            9
MINI               2
Mazda             11
Mercedes-Benz     26
Mercury            9
Mitsubishi        13
Nissan            17
Oldsmobile         3
Pontiac           11
Porsche            7
Saab               7
Saturn             8
Scion              2
Subaru            11
Suzuki             8
Toyota            28
Volkswagen        15
Volvo             12

In [107]:
#Count the type of cars:
df1=pd.crosstab(df.Type, columns='No_of_counts')
df1

col_0   No_of_counts
Type
Hybrid             3
SUV               60
Sedan            262
Sports            49
Truck             24
Wagon             30

In [108]:
#Sorting the type of cars in ascending order by their no of counts:
df1.sort_values('No_of_counts',ascending=True)

col_0   No_of_counts
Type
Hybrid             3
Truck             24
Wagon             30
Sports            49
SUV               60
Sedan            262

In [109]:
#Counting the Type of cars by their Origin: use pd.crosstab
pd.crosstab(index=df.Type, columns=df.Origin)

Origin  Asia  Europe  USA
Type
Hybrid     3       0    0
SUV       25      10   25
Sedan     94      78   90
Sports    17      23    9
Truck      8       0   16
Wagon     11      12    7

In [110]:
#Counting the Type of cars by their Origin and adding them: 
pd.crosstab(index=df.Type, columns=df.Origin, margins=True)

Origin  Asia  Europe  USA  All
Type
Hybrid     3       0    0    3
SUV       25      10   25   60
Sedan     94      78   90  262
Sports    17      23    9   49
Truck      8       0   16   24
Wagon     11      12    7   30
All      158     123  147  428

In [111]:
#Counting the Type of cars by their Origin,DriveTrain:
pd.crosstab(index=df.Type, columns=[df.Origin,df.DriveTrain])

Origin     Asia            Europe            USA
DriveTrain  All Front Rear    All Front Rear All Front Rear
Type
Hybrid        0     3    0      0     0    0   0     0    0
SUV          16     9    0     10     0    0  12    13    0
Sedan         7    78    9     18    30   30   3    71   16
Sports        2     5   10      3     2   18   0     1    8
Truck         5     0    3      0     0    0   7     0    9
Wagon         4     4    3      5     5    2   0     5    2

In [113]:
#Count of the Origin of the cars:
pd.crosstab(df.Origin, columns='Count_Origin')

col_0   Count_Origin
Origin
Asia             158
Europe           123
USA              147

In [119]:
#Sorting the count of Cylinders in ascending order:
df2= pd.crosstab(df.Cylinders, columns='Count_Cylinders')
df2

col_0      Count_Cylinders
Cylinders
3.0                      1
4.0                    136
5.0                      7
6.0                    190
8.0                     87
10.0                     2
12.0                     3

In [120]:
df2.sort_values('Count_Cylinders', ascending=True)

col_0      Count_Cylinders
Cylinders
3.0                      1
10.0                     2
12.0                     3
5.0                      7
8.0                     87
4.0                    136
6.0                    190

In [127]:
#Counting the EngineSize of cars by their MPG_Highway and MPG_City:
pd.crosstab(index=df.EngineSize, columns=[df.MPG_City, df.MPG_Highway])

MPG_City    10    12       13          14  ... 32       33 35 36 38 46 59 60
MPG_Highway 12 13 16 19 20 14 17 18 19 17  ... 37 38 40 39 43 44 46 51 51 66
EngineSize                                 ...
1.3          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
1.4          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  1  0  0
1.5          0  0  0  0  0  0  0  0  0  0  ...  0  1  0  1  2  0  0  0  1  0
1.6          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
1.7          0  0  0  0  0  0  0  0  0  0  ...  1  2  0  0  0  1  0  0  0  0
1.8          0  0  0  0  0  0  0  0  0  0  ...  0  0  3  0  0  0  0  0  0  0
1.9          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  1  0  0  0
2.0          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  1
2.2          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
2.3          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
2.4          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
2.5          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
2.6          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
2.7          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
2.8          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
2.9          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.0          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.1          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.2          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.3          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.4          0  0  0  0  0  0  0  0  0  1  ...  0  0  0  0  0  0  0  0  0  0
3.5          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.6          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.7          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.8          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.9          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
4.0          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
4.2          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
4.3          0  0  0  0  0  0  0  0  0  1  ...  0  0  0  0  0  0  0  0  0  0
4.4          0  0  1  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
4.5          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
4.6          0  0  1  0  0  0  0  1  0  0  ...  0  0  0  0  0  0  0  0  0  0
4.7          0  0  0  0  0  0  2  0  0  1  ...  0  0  0  0  0  0  0  0  0  0
4.8          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
5.0          0  0  0  0  0  1  0  0  0  1  ...  0  0  0  0  0  0  0  0  0  0
5.3          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
5.4          0  0  0  0  0  0  0  1  0  0  ...  0  0  0  0  0  0  0  0  0  0
5.5          0  0  0  0  0  0  0  0  2  0  ...  0  0  0  0  0  0  0  0  0  0
5.6          0  0  0  0  0  0  0  0  1  0  ...  0  0  0  0  0  0  0  0  0  0
5.7          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
6.0          1  0  0  1  0  0  3  1  0  0  ...  0  0  0  0  0  0  0  0  0  0
6.8          0  1  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
8.3          0  0  0  0  1  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0

[43 rows x 101 columns]

# Merging Data

In [129]:
dict1= {'name':['a','b','c'], 'age':[10,20,30], 'place':['S','T','P']}
dict2= {'name':['a','b','d'], 'age':[100,200,300], 'profession':['A','B','C']}
print(dict1)
print(dict2)

{'name': ['a', 'b', 'c'], 'age': [10, 20, 30], 'place': ['S', 'T', 'P']}
{'name': ['a', 'b', 'd'], 'age': [100, 200, 300], 'profession': ['A', 'B', 'C']}

In [137]:
#Converting dictionary into data frame:
df_dict1= pd.DataFrame(dict1, index=[1,2,3])
df_dict2= pd.DataFrame(dict2, index=[1,2,3])
print(df_dict1)
print(df_dict2)

  name  age place
1    a   10     S
2    b   20     T
3    c   30     P
  name  age profession
1    a  100          A
2    b  200          B
3    d  300          C

In [138]:
#merging by intersection(inner)
pd.merge(df_dict1, df_dict2, how= 'inner', on='name')

  name  age_x place  age_y profession
0    a     10     S    100          A
1    b     20     T    200          B

In [139]:
#Merging by union(outer)
pd.merge(df_dict1,df_dict2, how='outer', on='name')

  name  age_x place  age_y profession
0    a   10.0     S  100.0          A
1    b   20.0     T  200.0          B
2    c   30.0     P    NaN        NaN
3    d    NaN   NaN  300.0          C

In [142]:
#By default merging is inner(intersection)
pd.merge(df_dict1,df_dict2, on= 'name')

  name  age_x place  age_y profession
0    a     10     S    100          A
1    b     20     T    200          B

In [144]:
#Left join by merging two data frames:
pd.merge(df_dict1,df_dict2, how='left', on= 'name')

  name  age_x place  age_y profession
0    a     10     S  100.0          A
1    b     20     T  200.0          B
2    c     30     P    NaN        NaN

In [145]:
#Right join by merging two data frameS:
pd.merge(df_dict1, df_dict2, how='right', on='name')

  name  age_x place  age_y profession
0    a   10.0     S    100          A
1    b   20.0     T    200          B
2    d    NaN   NaN    300          C

# DEscriptive Statistics

In [1]:
import pandas as pd
import numpy as np

In [2]:
cars= pd.read_csv('C:\Python\Dataset\CARS.csv')

In [3]:
cars.head()

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Acura,MDX,SUV,Asia,All,"$36,945","$33,337",3.5,6.0,265,17,23,4451,106,189
1,Acura,RSX Type S 2dr,Sedan,Asia,Front,"$23,820","$21,761",2.0,4.0,200,24,31,2778,101,172
2,Acura,TSX 4dr,Sedan,Asia,Front,"$26,990","$24,647",2.4,4.0,200,22,29,3230,105,183
3,Acura,TL 4dr,Sedan,Asia,Front,"$33,195","$30,299",3.2,6.0,270,20,28,3575,108,186
4,Acura,3.5 RL 4dr,Sedan,Asia,Front,"$43,755","$39,014",3.5,6.0,225,18,24,3880,115,197

In [4]:
cars.tail()

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
423,Volvo,C70 LPT convertible 2dr,Sedan,Europe,Front,"$40,565","$38,203",2.4,5.0,197,21,28,3450,105,186
424,Volvo,C70 HPT convertible 2dr,Sedan,Europe,Front,"$42,565","$40,083",2.3,5.0,242,20,26,3450,105,186
425,Volvo,S80 T6 4dr,Sedan,Europe,Front,"$45,210","$42,573",2.9,6.0,268,19,26,3653,110,190
426,Volvo,V40,Wagon,Europe,Front,"$26,135","$24,641",1.9,4.0,170,22,29,2822,101,180
427,Volvo,XC70,Wagon,Europe,All,"$35,145","$33,112",2.5,5.0,208,20,27,3823,109,186

In [5]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 428 entries, 0 to 427
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name_of_car  428 non-null    object
 1   Model        428 non-null    object
 2   Type         428 non-null    object
 3   Origin       428 non-null    object
 4   DriveTrain   428 non-null    object
 5   MSRP         428 non-null    object
 6   Invoice      428 non-null    object
 7   EngineSize   428 non-null    float64
 8   Cylinders    426 non-null    float64
 9   Horsepower   428 non-null    int64
 10  MPG_City     428 non-null    int64
 11  MPG_Highway  428 non-null    int64
 12  Weight       428 non-null    int64
 13  Wheelbase    428 non-null    int64
 14  Length       428 non-null    int64
dtypes: float64(2), int64(6), object(7)
memory usage: 50.3+ KB

In [6]:
cars.describe()

,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
count,428.000000,426.000000,428.000000,428.000000,428.000000,428.000000,428.000000,428.000000
mean,3.196729,5.807512,215.885514,20.060748,26.843458,3577.953271,108.154206,186.362150
std,1.108595,1.558443,71.836032,5.238218,5.741201,758.983215,8.311813,14.357991
min,1.300000,3.000000,73.000000,10.000000,12.000000,1850.000000,89.000000,143.000000
25%,2.375000,4.000000,165.000000,17.000000,24.000000,3104.000000,103.000000,178.000000
50%,3.000000,6.000000,210.000000,19.000000,26.000000,3474.500000,107.000000,187.000000
75%,3.900000,6.000000,255.000000,21.250000,29.000000,3977.750000,112.000000,194.000000
max,8.300000,12.000000,500.000000,60.000000,66.000000,7190.000000,144.000000,238.000000

In [7]:
#To get mean of all the columns:
cars.mean()

EngineSize        3.196729
Cylinders         5.807512
Horsepower      215.885514
MPG_City         20.060748
MPG_Highway      26.843458
Weight         3577.953271
Wheelbase       108.154206
Length          186.362150
dtype: float64

In [8]:
cars.EngineSize.mean()

3.1967289719626195

In [10]:
#To get mean of all the rows:
cars.mean(axis=1)

0      632.5625
1      414.0000
2      471.9250
3      524.5250
4      558.5625
         ...
423    499.3000
424    504.5375
425    534.3625
426    416.2375
427    547.5625
Length: 428, dtype: float64

In [11]:
#To get median of each column:
cars.median()

EngineSize        3.0
Cylinders         6.0
Horsepower      210.0
MPG_City         19.0
MPG_Highway      26.0
Weight         3474.5
Wheelbase       107.0
Length          187.0
dtype: float64

In [12]:
#To get median of each row:
cars.median(axis=1)

0      64.5
1      66.0
2      67.0
3      68.0
4      69.5
       ...
423    66.5
424    65.5
425    68.0
426    65.0
427    68.0
Length: 428, dtype: float64

In [13]:
#mode- highest frequency:
cars.mode()

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Toyota,C240 4dr,Sedan,Asia,Front,"$13,270","$14,207",3.0,6.0,200.0,18.0,26.0,3175.0,107.0,178.0
1,NaN,C320 4dr,NaN,NaN,NaN,"$15,389","$19,638",NaN,NaN,NaN,NaN,NaN,3285.0,NaN,NaN
2,NaN,G35 4dr,NaN,NaN,NaN,"$19,635","$68,306",NaN,NaN,NaN,NaN,NaN,3450.0,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,"$19,860",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,"$21,055",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,"$21,595",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,"$23,495",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,"$23,895",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,"$25,700",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,NaN,NaN,NaN,NaN,NaN,"$27,490",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,"$28,495",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,NaN,NaN,NaN,NaN,NaN,"$29,995",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,NaN,NaN,NaN,NaN,NaN,"$31,545",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,NaN,NaN,NaN,NaN,NaN,"$33,995",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,NaN,NaN,NaN,NaN,NaN,"$34,495",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,NaN,NaN,NaN,NaN,NaN,"$35,940",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,NaN,NaN,NaN,NaN,NaN,"$49,995",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,NaN,NaN,NaN,NaN,NaN,"$74,995",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
#variance
cars.var()

EngineSize          1.228982
Cylinders           2.428743
Horsepower       5160.415434
MPG_City           27.438924
MPG_Highway        32.961386
Weight         576055.520060
Wheelbase          69.086235
Length            206.151913
dtype: float64

In [16]:
#standard deviation
cars.std()

EngineSize       1.108595
Cylinders        1.558443
Horsepower      71.836032
MPG_City         5.238218
MPG_Highway      5.741201
Weight         758.983215
Wheelbase        8.311813
Length          14.357991
dtype: float64

In [17]:
#maximum value of MPG_City:
cars.MPG_City.max()

60

In [21]:
#Counting the EngineSize of cars by their MPG_Highway and MPG_City:
pd.crosstab(index= cars.EngineSize, columns=[cars.MPG_Highway, cars.MPG_City])

MPG_Highway 12 13 14 16 17    18       19  ... 37 38 39 40 43 44 46 51    66
MPG_City    10 10 13 12 13 14 13 14 16 12  ... 32 32 33 32 35 36 38 46 59 60
EngineSize                                 ...
1.3          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
1.4          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  1  0  0
1.5          0  0  0  0  0  0  0  0  0  0  ...  0  1  1  0  2  0  0  0  1  0
1.6          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
1.7          0  0  0  0  0  0  0  0  0  0  ...  1  2  0  0  0  1  0  0  0  0
1.8          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  3  0  0  0  0  0  0
1.9          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  1  0  0  0
2.0          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  1
2.2          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
2.3          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
2.4          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
2.5          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
2.6          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
2.7          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
2.8          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
2.9          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.0          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.1          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.2          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.3          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.4          0  0  0  0  0  1  0  0  1  0  ...  0  0  0  0  0  0  0  0  0  0
3.5          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.6          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.7          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.8          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3.9          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
4.0          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
4.2          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
4.3          0  0  0  0  0  1  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
4.4          0  0  0  1  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
4.5          0  0  0  0  0  0  0  1  0  0  ...  0  0  0  0  0  0  0  0  0  0
4.6          0  0  0  1  0  0  1  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
4.7          0  0  0  0  2  1  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
4.8          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
5.0          0  0  1  0  0  1  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
5.3          0  0  0  0  0  0  0  4  0  0  ...  0  0  0  0  0  0  0  0  0  0
5.4          0  0  0  0  0  0  1  1  0  0  ...  0  0  0  0  0  0  0  0  0  0
5.5          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
5.6          0  0  0  0  0  0  0  1  0  0  ...  0  0  0  0  0  0  0  0  0  0
5.7          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
6.0          1  0  0  0  3  0  1  0  0  1  ...  0  0  0  0  0  0  0  0  0  0
6.8          0  1  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
8.3          0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0

[43 rows x 101 columns]

In [25]:
#Sorting the count of Cylinders in ascending order:
cars_count= pd.crosstab(index=cars.Cylinders, columns='Count')
cars_count

col_0      Count
Cylinders
3.0            1
4.0          136
5.0            7
6.0          190
8.0           87
10.0           2
12.0           3

In [34]:
#Sorting in ascending order:
cars_count.sort_values('Count',ascending=True)

col_0      Count
Cylinders
3.0            1
10.0           2
12.0           3
5.0            7
8.0           87
4.0          136
6.0          190

In [39]:
cars.Weight.quantile(0.25)

3104.0

In [40]:
cars.Weight.quantile(0.5)

3474.5

In [42]:
cars.Weight.median()

3474.5

In [46]:
#Intraquantile range: Q3-Q1
cars.Weight.quantile(0.75)-cars.Weight.quantile(0.25)

873.75